; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-2-1-3-3-3-7) (:domain depots)
(:objects
	depot0 depot1 - Depot
	distributor0 - Distributor
	truck0 truck1 truck2 - Truck
	pallet0 pallet1 pallet2 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 - Crate
	hoist0 hoist1 hoist2 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate5)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 distributor0)
	(clear crate6)
	(at truck0 distributor0)
	(at truck1 depot1)
	(at truck2 depot0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 distributor0)
	(available hoist2)
	(at crate0 distributor0)
	(on crate0 pallet2)
	(at crate1 depot0)
	(on crate1 pallet0)
	(at crate2 distributor0)
	(on crate2 crate0)
	(at crate3 depot0)
	(on crate3 crate1)
	(at crate4 distributor0)
	(on crate4 crate2)
	(at crate5 depot0)
	(on crate5 crate3)
	(at crate6 distributor0)
	(on crate6 crate4)
)

(:goal (and
		(on crate0 pallet2)
		(on crate1 pallet1)
		(on crate2 crate4)
		(on crate3 crate0)
		(on crate4 crate3)
		(on crate6 crate1)
	)
))

; plan
1. (lift hoist0 crate5 crate3 depot0)
   deleted: (at crate5 depot0) (available hoist0) (on crate5 crate3) (clear crate5)
   added: (lifting hoist0 crate5) (clear crate3)
   goals met: 1 of 6
2. (load hoist0 crate5 truck2 depot0)
   deleted: (lifting hoist0 crate5)
   added: (in crate5 truck2) (available hoist0)
   goals met: 1 of 6
3. (lift hoist0 crate3 crate1 depot0)
   deleted: (at crate3 depot0) (available hoist0) (on crate3 crate1) (clear crate3)
   added: (lifting hoist0 crate3) (clear crate1)
   goals met: 1 of 6
4. (load hoist0 crate3 truck2 depot0)
   deleted: (lifting hoist0 crate3)
   added: (in crate3 truck2) (available hoist0)
   goals met: 1 of 6
5. (lift hoist0 crate1 pallet0 depot0)
   deleted: (at crate1 depot0) (available hoist0) (on crate1 pallet0) (clear crate1)
   added: (lifting hoist0 crate1) (clear pallet0)
   goals met: 1 of 6
6. (load hoist0 crate1 truck2 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck2) (available hoist0)
   goals met: 1 of 6
7. (lift hoist2 crate6 crate4 distributor0)
   deleted: (at crate6 distributor0) (available hoist2) (on crate6 crate4) (clear crate6)
   added: (lifting hoist2 crate6) (clear crate4)
   goals met: 1 of 6
8. (drive truck2 depot0 distributor0)
   deleted: (at truck2 depot0)
   added: (at truck2 distributor0)
   goals met: 1 of 6
9. (load hoist2 crate6 truck2 distributor0)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck2) (available hoist2)
   goals met: 1 of 6
10. (lift hoist2 crate4 crate2 distributor0)
   deleted: (at crate4 distributor0) (available hoist2) (on crate4 crate2) (clear crate4)
   added: (lifting hoist2 crate4) (clear crate2)
   goals met: 1 of 6
11. (load hoist2 crate4 truck0 distributor0)
   deleted: (lifting hoist2 crate4)
   added: (in crate4 truck0) (available hoist2)
   goals met: 1 of 6
12. (lift hoist2 crate2 crate0 distributor0)
   deleted: (at crate2 distributor0) (available hoist2) (on crate2 crate0) (clear crate2)
   added: (lifting hoist2 crate2) (clear crate0)
   goals met: 1 of 6
13. (load hoist2 crate2 truck0 distributor0)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck0) (available hoist2)
   goals met: 1 of 6
14. (unload hoist2 crate3 truck2 distributor0)
   deleted: (available hoist2) (in crate3 truck2)
   added: (lifting hoist2 crate3)
   goals met: 1 of 6
15. (drop hoist2 crate3 crate0 distributor0)
   deleted: (lifting hoist2 crate3) (clear crate0)
   added: (at crate3 distributor0) (available hoist2) (on crate3 crate0) (clear crate3)
   goals met: 2 of 6
16. (drive truck2 distributor0 depot1)
   deleted: (at truck2 distributor0)
   added: (at truck2 depot1)
   goals met: 2 of 6
17. (unload hoist1 crate1 truck2 depot1)
   deleted: (available hoist1) (in crate1 truck2)
   added: (lifting hoist1 crate1)
   goals met: 2 of 6
18. (drop hoist1 crate1 pallet1 depot1)
   deleted: (lifting hoist1 crate1) (clear pallet1)
   added: (at crate1 depot1) (available hoist1) (on crate1 pallet1) (clear crate1)
   goals met: 3 of 6
19. (unload hoist1 crate6 truck2 depot1)
   deleted: (available hoist1) (in crate6 truck2)
   added: (lifting hoist1 crate6)
   goals met: 3 of 6
20. (drop hoist1 crate6 crate1 depot1)
   deleted: (lifting hoist1 crate6) (clear crate1)
   added: (at crate6 depot1) (available hoist1) (on crate6 crate1) (clear crate6)
   goals met: 4 of 6
21. (unload hoist2 crate4 truck0 distributor0)
   deleted: (available hoist2) (in crate4 truck0)
   added: (lifting hoist2 crate4)
   goals met: 4 of 6
22. (drop hoist2 crate4 crate3 distributor0)
   deleted: (lifting hoist2 crate4) (clear crate3)
   added: (at crate4 distributor0) (available hoist2) (on crate4 crate3) (clear crate4)
   goals met: 5 of 6
23. (unload hoist2 crate2 truck0 distributor0)
   deleted: (available hoist2) (in crate2 truck0)
   added: (lifting hoist2 crate2)
   goals met: 5 of 6
24. (drop hoist2 crate2 crate4 distributor0)
   deleted: (lifting hoist2 crate2) (clear crate4)
   added: (at crate2 distributor0) (available hoist2) (on crate2 crate4) (clear crate2)
   goals met: 6 of 6
